#Софія
import numpy as np

EPS = 1e-4  # точність для завдання 2

# Завдання 1: A·x = b
A = np.array([
    [1,  1,  2,  0],
    [2,  0,  1,  3],
    [3,  2,  0, -1],
    [0, -2, -1,  4],
], dtype=float)
b = np.array([1, -2, 0, -3], dtype=float)

# Завдання 2: x = C·x + D (як у варіанті; на діагоналі C НЕ нулі)
C = np.array([
    [0.26, -0.14,  0.02,  0.24],
    [0.15,  0.12, -0.17,  0.26],
    [0.35,  0.22, -0.03, -0.27],
    [0.12,  0.24, -0.15,  0.23],
], dtype=float)
D = np.array([1.73, -0.65, 2.26, -1.17], dtype=float)
